/*-----------------------------------------------------------------------------------------------------------------
Дасгал №1.Менежер эсвэл ахлах ажилчдын мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM staff
WHERE position1="Manager" OR position1="Supervisor";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №2.Эмэгтэй ажилчдын мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM staff
WHERE sex="F";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №3.3-аас 5-н өрөөтэй үл хөдлөх хөрөнгийн мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
	SELECT*
FROM propertyforrent
WHERE rooms BETWEEN 3 AND 5;

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №4.Түрээсийн үнэ нь 450-аас их байх эсвэл London хотод байрладаг үл хөдлөх хөрөнгийн мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM propertyforrent
WHERE rent>450 OR city="London";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №5.Зөвхөн ажилтан хариуцаж авсан орон сууцны байрлаж буй хот, эзэмшигчийн дугаар үнийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №6.
Цалин нь 20000-с их байх, эрэгтэй ажилчдын мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT*
FROM staff
WHERE salary>20000 AND sex="M";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №7.Түрээс нь 400-600  байх, Glasgowхотод байрлах үл хөдлөх хөрөнгийн мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM propertyforrent
WHERE city="Glasgow" AND rent BETWEEN 400 AND 600;

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №8.London хотод байрлах эсвэл 4 өрөөтэй үл хөдлөх хөрөнгийн мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM propertyforrent
WHERE city="London" AND rooms="4";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №9.1970 оны 1-р сарын 1-нээс өмнө төрсөн, туслах ажилтнуудын мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM staff
WHERE DOB<"1970-1-1" AND position1="Assistant";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №10.2004 оны 5-р сард үзсэн үл хөдлөх хөрөнгийн мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM viewing
WHERE viewDate like "2004-05%";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №11.Салбарын дугаар нь B007 юмуу эсвэл менежер албан тушаалд ажилладаг хүмүүсийн мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM staff
WHERE branchNo="B007" OR position1="Manager";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №12.Aberdeen хотод байрлах үл хөдлөх хөрөнгийн мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT *
FROM propertyforrent
WHERE city="Aberdeen";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №13. Үл хөдлөх хөрөнгийн бүртгэл хийсэн ажилчдын дугаар, харилцагчийн дугаарыг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT staffNo, ownerNo
FROM propertyforrent;

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №14. 3-н өрөөтэй орон сууц хариуцан ажиллаж байгаа ажилчдын дугаар, үл хөдлөх хөрөнгийн дугаар, үнэ, эзэмшигчийн дугаарыг харуулна уу. 
-----------------------------------------------------------------------------------------------------------------*/
SELECT staffNo, propertyNo, rent,ownerNo
FROM propertyforrent
WHERE rooms="3";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №15.Цалин нь 20000-с их байх эсвэл B007 салбарт ажилладаг, эмэгтэй ажилчдын мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT*
FROM staff
WHERE sex="F" AND salary>20000 OR branchNo="B007";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №16. Үл хөдлөх хөрөнгийг үзээд “no dining room” гэж сэтгэгдэл үлдээсэн харилцагчийн дугаар, үзсэн огноог гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT clientNo, viewDate
FROM viewing
WHERE comment1="no dining room";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №17. SG37 гэсэн кодтой ажилтны бүртгэл хийсэн харилцагчийн дугаар, салбар, огноог харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT* 
from registration
where staffNo="SG37";

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №18. Ажилчдын дугаар, нэр, албан тушаал болон цалинг харуулахын зэрэгцээ хагас сарын цалин нэртэй аттрибут үүсгэж хагас сарын цалинг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT staffNo, IName, position1, salary, salary/2 as hagassar
FROM staff;

/*-----------------------------------------------------------------------------------------------------------------
Дасгал №19. 4 өрөөтэй орон сууц/Flat/-ын дугаар, эзэмшигчийн дугаар, түрээслэх үнэ болон үнийг5 хувиар бууруулж шинэ багана үүсгэн харуулна уу. 
-----------------------------------------------------------------------------------------------------------------*/
SELECT type1, propertyNo, rent, rent-rent*0.05 as rent2
 from propertyforrent
 where rooms=4;
 
/*-----------------------------------------------------------------------------------------------------------------
Дасгал №20. SL41 кодтой ажилтны албан тушаалыг Manager болгож цалинг 10 хувиар нэмэгдүүлнэ үү.
-----------------------------------------------------------------------------------------------------------------*/
UPDATE Staff
SET position1="Manager"
WHERE position1="Assistant";

