use dreamhome;
set SQL_SAFE_UPDATES = 0;
SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''));
/*-----------------------------------------------------------------------------------------------------------------
1.Ажилтан, харилцагч, хувийн эзэмшигч гэсэн хүснэгтүүдээс хүмүүсийн нэрсийн
жагсаалтыг гаргана уу (Union).
-----------------------------------------------------------------------------------------------------------------*/
select IName, fname from staff 
union 
select IName, fname from privateowner 
union 
select IName, fname from client1;

/*-----------------------------------------------------------------------------------------------------------------
2. Харилцагч болон хувийн эзэмшигчдээс 22 гэсэн тоо орсон утасны дугаартай хүмүүсийн
нэр, овог, утасны дугаарыг харуулна уу (Union).
-----------------------------------------------------------------------------------------------------------------*/
select fName, IName, telNo
from client1
where telNo like "%22%"
union 
select fName, IName, telNo
from privateowner
where telNo like "%22%";

/*-----------------------------------------------------------------------------------------------------------------
3. 3 өрөөтэй, Flat төрлийн үл хөдлөх хөрөнгө түрээслүүлэх гэж буй эзэмшигчийн мэдээлэл
болон уг хөрөнгийг хариуцан ажиллаж буй ажилтны нэр, код, албан тушаалыг харуулна
уу
-----------------------------------------------------------------------------------------------------------------*/
select s.staffNo, s.fName, s.position1, o.*
from staff s, privateowner o, propertyforrent p
where (p.type1="Flat" and p.rooms=3)and p.ownerNo=o.ownerNo and p.staffNo=s.staffNo;

/*-----------------------------------------------------------------------------------------------------------------
4. Үл хөдлөх хөрөнгийн нөөц хүснэгт үүсгэж үндсэн хүснэгтийн мэдээллийг оруулна уу
-----------------------------------------------------------------------------------------------------------------*/
CREATE TABLE propertyforrent1 
SELECT * 
FROM propertyforrent ;

/*-----------------------------------------------------------------------------------------------------------------
5. John-ийн бүртгэлийг хийсэн ажилтны дугаар, нэр, албан тушаал, аль хотын ямар салбарт
ажилладаг болон уг салбарын шуудангийн дугаарыг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
 SELECT s.staffNo, s.fname, s.IName, s.position1, b.city, b.branchNo, b.postcode 
FROM registration r, branch b, staff s, client1 c 
WHERE r.staffNo=s.staffNo AND b.branchNo=r.branchno AND r.clientNo=c.clientNo AND c.fName="John" ;
/*-----------------------------------------------------------------------------------------------------------------
6. Tony-ын түрээслүүлэх гэж байгаа үл хөдлөх хөрөнгийг үзсэн харилцагчийн мэдээллийг
харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
 SELECT c.* 
FROM privateowner p, viewing v, client1 c,propertyforrent f 
WHERE p.fName="Tony" AND p.ownerNo=f.ownerNo AND f.propertyNo=v.propertyNo AND v.clientNo=c.clientNo ;

/*-----------------------------------------------------------------------------------------------------------------
7. Үл хөдлөх хөрөнгийн мэдээллийг хотоор нь ангилж, 2-оос илүү үл хөдлөх хөрөнгөтэй
хотын салбарын дугаар, хотын нэр, үл хөдлөх хөрөнгийн тоог шүүж гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
 SELECT propertyNo, city, rooms, branchNo, COUNT(city) AS countCity 
FROM propertyforrent 
GROUP BY city 
ORDER BY COUNT(city) 
DESC LIMIT 1;

/*-----------------------------------------------------------------------------------------------------------------
8. StaffPropCount(staffNo, fName, lName, propCount) хүснэгт үүсгэж ажилтны хариуцан
ажиллаж байгаа үл хөдлөх хөрөнгийн тоог гаргана уу. Join ашиглана уу.
-----------------------------------------------------------------------------------------------------------------*/
CREATE TABLE StaffPropCount 
SELECT s.staffNo, s.fName, s.IName, p.propertyNo, COUNT(propertyNo) AS propcount 
FROM staff s, propertyforrent p
WHERE s.staffNo=p.staffNo 
GROUP BY staffNo; 

/*-----------------------------------------------------------------------------------------------------------------
9. BranchInf(branchNo, city, staffcount) хүснэгт үүсгэж салбар бүрийн ажилтны тоог харуулна уу.
Join ашиглана уу.
-----------------------------------------------------------------------------------------------------------------*/
CREATE TABLE BranchInf 
SELECT s.staffNo, b.city, s.branchNo, COUNT(s.branchNo) AS staffCount 
FROM staff s, branch b 
WHERE b.branchNo=s.branchNo 
GROUP BY s.branchNo;

/*-----------------------------------------------------------------------------------------------------------------
10. B005 салбарын ажилтан тус бүрийн хариуцаж байгаа үл хөдлөх хөрөнгийн тоо болон
салбарын дугаарыг гаргана уу
-----------------------------------------------------------------------------------------------------------------*/
SELECT b.branchNo, COUNT(b.branchNo) AS propCount 
FROM branch b, propertyforrent p 
WHERE b.branchNo="B005" AND p.branchNo=b.branchNo ;

/*-----------------------------------------------------------------------------------------------------------------
11. Үл хөдлөх хөрөнгийг үзээд “no dining room” гэсэн сэтгэгдэлтэй үл хөдлөх хөрөнгийг
түрээслүүлж буй хүний нэр, хаяг, утасны дугаар болон тухайн үл хөдлөх хөрөнгийн байрлах
хот, төрөл, хэн гэдэг ямар албан тушаалтай ажилтан хариуцаж байгаа талаарх мэдээллийг
гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT o.fname, o.lname, o.address, o.telNo, p.city, p.type1, s.fname, s.lname, s.position1 
FROM privateowner o, propertyforrent p, staff s, viewing v
WHERE v.comment1="no dining room" AND v.propertyNo=p.propertyNo AND p.ownerNo=o.ownerNo AND p.staffno=s.staffNo ;

/*-----------------------------------------------------------------------------------------------------------------
12. Хот бүрийн салбаруудад албан тушаал тус бүр дээр хэдэн ажилтан ажилладаг вэ?
-----------------------------------------------------------------------------------------------------------------*/
SELECT b.city, s.position1, COUNT(position1) 
FROM branch b, staff s 
WHERE b.branchNo=s.branchNo 
GROUP BY b.city, s.position1; 

/*-----------------------------------------------------------------------------------------------------------------
13. Хаана оршин суудаг, хэн гэдэг хүний, ямар кодтой, хэдэн өрөөтэй үл хөдлөх хөрөнгийг
ажилтан хариуцаж аваагүй байгаа вэ?
-----------------------------------------------------------------------------------------------------------------*/
SELECT o.address, o.fname, o.lname, p.propertyNo, p.rooms 
FROM privateowner o, propertyforrent p 
WHERE p.staffNo LIKE " " AND p.ownerNo=o.ownerNo ;

/*-----------------------------------------------------------------------------------------------------------------
14. Үл хөдлөх хөрөнгийн бүртгэл хийсэн ажилтны нэр, албан тушаал, түүний ажилладаг салбар
ямар гудамжинд байрладаг болон бүртгүүлсэн харилцагчийн нэр, санал болгож буй хамгийн их
үнийн мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
SELECT s.fName, s.lName, s.position1, s.branchNo, b.street, c.fname, c.lname, c.maxrent 
FROM staff s, branch b, client1 c, registration r 
WHERE r.clientNo=c.clientNo AND r.staffNo=s.staffNo AND r.branchNo=b.branchNo ;

/*-----------------------------------------------------------------------------------------------------------------
15. Mary-ийн бүртгэлийг хийсэн ажилтны хариуцаж буй үл хөдлөх хөрөнгийн мэдээллийг
гаргана уу (Subquery бичнэ үү).
-----------------------------------------------------------------------------------------------------------------*/
SELECT * 
FROM propertyforrent 
WHERE staffNo=(SELECT staffNo 
				FROM registration 
                WHERE clientNo=(SELECT clientNo 
								FROM client1 
                                WHERE fName="Mary" ) ); 

/*-----------------------------------------------------------------------------------------------------------------
16. Үл хөдлөх хөрөнгийг үзээд “ too remote” гэж сэтгэгдэл үлдээсэн харилцагчийн дугаар, нэр
/Fname/, утасны дугаар, түүний үзсэн үл хөдлөх хөрөнгө хэдэн өрөөтэй, ямар үнэтэй болон
түрээслүүлэх гэж байгаа хүний нэр, холбоо барих утасны дугаарыг гаргана уу
-----------------------------------------------------------------------------------------------------------------*/
SELECT v.clientNo, c.fName, c.telNo, p.rooms, p.rent, o.fname, o.telNo 
FROM viewing v, client1 c, propertyforrent p, privateowner o 
WHERE comment1="too remote" AND v.clientNo=c.clientNo AND v.propertyNo=p.propertyNo AND p.ownerNo=o.ownerNo;

