use dreamhome;
set SQL_SAFE_UPDATES = 0;

select*from branch;
select*from staff;
select*from client1;
select*from propertyForrent;
select*from viewing;
select*from registration;
/*-----------------------------------------------------------------------------------------------------------------
1.Үл хөдлөх хөрөнгийн дугаар, байрлах хот, үнэ, хариуцан ажиллаж буй ажилтны код, 
овог нэр, албан тушаалыг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
select p.propertyNo, p.city, p.rent, p.staffNo, s.IName, s.fName
from propertyforrent p, staff s
where s.staffNo=p.staffNo;

/*-----------------------------------------------------------------------------------------------------------------
2.Салбар бүрийн ажилтнуудын хариуцаж байгаа үл хөдлөх хөрөнгийн дундаж үнэ, хамгийн их болон бага 
үнийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
select branchNo, avg(rent), max(rent), min(rent)
from propertyforrent 
group by branchNo;

/*-----------------------------------------------------------------------------------------------------------------
3.Салбар байрлаж байгаа хот, үл хөдлөх хөрөнгийн хот нь ижилхэн байх салбарын мэдээлэл болон үл хөдлөх 
хөрөнгийн мэдээллийг гаргана уу.
-----------------------------------------------------------------------------------------------------------------*/
select p.*, b.*
from branch b, propertyforrent p
where p.city=b.city and p.branchNo=b.branchNo
union all
(select city
from branch)
intersect
(select city
from propertyforrent)

/*-----------------------------------------------------------------------------------------------------------------
4.Дээрх жишээний хувьд Left, Right join бичиж ялгааг тайлбарлана уу.
-----------------------------------------------------------------------------------------------------------------*/
select p.*, b.*
from branch b left join propertyforrent p on
 b.city=p.city;
 
select p.*, b.*
from branch b right join propertyforrent p on
 b.city=p.city;

/*-----------------------------------------------------------------------------------------------------------------
5.Салбар, үл хөдлөх хөрөнгийн хүснэгтэд байгаа ялгаатай хотын нэрсийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
select city
from branch
union

/*-----------------------------------------------------------------------------------------------------------------
6.Салбар, үл хөдлөх хөрөнгийн хүснэгтээс адилхан хотын нэрсийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------------------------
7.M үсгээр эхэлсэн хүний бүртгэлийг хийсэн ажилтны дугаар, нэр, албан тушаал, аль хотод,
ямар гудамжинд байрлах салбарт ажилладаг тухай мэдээллийг гаргана уу. 
-----------------------------------------------------------------------------------------------------------------*/
select s.staffNo, s.IName, s.position1, b.street, b.city
from staff s, branch b, client1 c, registration r
where r.branchNo=b.branchNo and r.staffNo=s.staffNo and r.clientNo=c.clientNo and c.fName like "M%" ;

/*-----------------------------------------------------------------------------------------------------------------
8.Mary-гийн хариуцаж байгаа үл хөдлөх хөрөнгийг түрээслүүлэж байгаа хүний нэр, хаяг утасны дугаар, үл хөдлөх хөрөнгө 
байрлах хотын нэр, байрны төрөл, үнийн мэдээллийг харуулна уу.
-----------------------------------------------------------------------------------------------------------------*/
select c.IName, c.telNo, p.city, p.type1, p.rent, p.street
from staff s, propertforrent p, cleint1
where s.staffNo=p.staffNo and 
